system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

ulip 0.5; top 13;
llip -0.5; bot -7;
len 40;

vertices
(
    (0 $ulip 0)
    (0 $top 0)
    ($len $top 0)
    ($len $ulip 0)
    
    ($len $llip 0)
    ($len $bot  0)
    (0 $bot 0)
    (0 $llip 0)
    
    (0 $ulip 0.1)
    (0 $top 0.1)
    ($len $top 0.1)
    ($len $ulip 0.1)
    
    ($len $llip 0.1)
    ($len $bot  0.1)
    (0 $bot 0.1)
    (0 $llip 0.1)

);

blocks
(
    hex (0 3 2 1 8 11 10 9) (200 60 1) simpleGrading (1 15 1)
    hex (7 4 3 0 15 12 11 8) (200 40 1) simpleGrading (1 1 1)
    hex (6 5 4 7 14 13 12 15) (200 40 1) simpleGrading (1 0.067 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 15 8 0)
        );
    }
    
    leftup
    {
        type wall;
        faces
        (
            (0 8 9 1)
        );
    }
    
    leftdown
    {
        type wall;
        faces
        (
            (7 6 14 15)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (11 3 2 10)
            (12 4 3 11)
            (5 4 12 13)
        );
    }
    
    top
    {
        type patch;
        faces
        (
            (2 1 9 10)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (6 5 13 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 0 3 4)
            (7 4 5 6)
            (8 11 10 9)
            (15 12 11 8)
            (13 12 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
