0/TMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 385.15;
    }
    leftup
    {
        type            calculated;
        value           uniform 298;
    }
    leftdown
    {
        type            calculated;
        value           uniform 298;
    }
    outlet
    {
        type            calculated;
        value           uniform 298;
    }
    top
    {
        type            calculated;
        value           uniform 298;
    }
    bottom
    {
        type            calculated;
        value           uniform 298;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
