0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type            calculated;
       value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    
    leftup
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    leftdown
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    top
    {
         type            zeroGradient;
    }
    bottom
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
