0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    leftup
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
20.1246
20.1246
20.1246
20.1246
20.1246
20.1246
20.1246
20.1246
...
)
;
    }
    leftdown
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
20.1246
20.1246
20.1246
20.1246
20.1246
20.1246
20.1246
20.1246
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
20.1246
46.7169
46.7169
46.7169
46.7169
46.7169
46.7169
46.7169
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
